# Veri Okuma, Yazma

veriler , ile ayrılmışsa read_csv ile , 1 tab boşluk ile ayrılmışsa read_table ile verinin içeri aktarılması yapılır.

In [1]:
import pandas as pd

In [2]:
df = pd.read_table("https://raw.githubusercontent.com/TirendazAcademy/PANDAS-TUTORIAL/main/DataSets/data2.txt")

In [3]:
df

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

Gördüğümüz gibi data , ile ayrılmış ancak biz read_table ile içeri aktarmışız ve bu virgüller verileri kirletmiş. Bu sorunun çözümü şudur(sep komutu)

In [39]:
df = pd.read_table("https://raw.githubusercontent.com/TirendazAcademy/PANDAS-TUTORIAL/main/DataSets/data2.txt",sep=",")

In [5]:
df

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

datamızda sütün ismi olmadığından ilk satırı sütün olarak değerlendirmiş. Bunun çözümü ise header komutudur

In [6]:
df = pd.read_table("https://raw.githubusercontent.com/TirendazAcademy/PANDAS-TUTORIAL/main/DataSets/data2.txt",sep=",",header=None,names=["isim","puan","cinsiyet"])

In [7]:
df

   isim  puan cinsiyet
0   Tom    80        M
1   Tim    85        M
2   Kim    70        M
3  Kate    90        F
4  Alex    75        F

datamız şuan daha okunabilir halde. Peki datamızın indeksini bir sütun olacak şekilde belirlersek(index_col komutuyla) !!

In [8]:
df = pd.read_table("https://raw.githubusercontent.com/TirendazAcademy/PANDAS-TUTORIAL/main/DataSets/data2.txt",sep=",",header=None,names=["isim","puan","cinsiyet"],index_col="isim")

In [9]:
df

      puan cinsiyet
isim
Tom     80        M
Tim     85        M
Kim     70        M
Kate    90        F
Alex    75        F

Artık isimler bizim index imiz oldu

# EKSİK - KAYIP, VERİ

series tipinde eksik veri oluşturalım

In [10]:
import numpy as np

In [11]:
s = pd.Series(["tufan","123",np.nan])

In [12]:
s

0    tufan
1      123
2      NaN
dtype: object

Eksik verinin tespiti için

In [13]:
s.isnull()

0    False
1    False
2     True
dtype: bool

Eksik verileri kaldırmak istersek

In [14]:
s.dropna()

0    tufan
1      123
dtype: object

Data frame yapısında eksik verileri nasıl kaldıracağız

In [15]:
df = pd.DataFrame([[1,2,3],[4,5,np.nan],[np.nan,np.nan,np.nan]])

In [16]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  NaN  NaN

dropna methodu eksik verileri içeren SATIRları kaldırır.

In [17]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [18]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  NaN  NaN  NaN

Bütün değerleri eksik veri içeren satırları kaldırmak için how parametresi kullanılır.

In [19]:
df.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN

Bütün değerleri eksik veri olan sütunu kaldırmak için axis=1 komutu kullanılır

Eksik verilere değer atamak istersek

In [20]:
df.fillna(0)

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  0.0
2  0.0  0.0  0.0

In [21]:
df.fillna({0:15,1:25,2:35})

      0     1     2
0   1.0   2.0   3.0
1   4.0   5.0  35.0
2  15.0  25.0  35.0

bu işlemleri modifiye etmek için inplace=True komutu kullanılmalı

In [22]:
df.fillna(0,inplace=True)

In [23]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  0.0
2  0.0  0.0  0.0

Eksik verilerin bulunduğu sütun ortalamalarının değerini atar

In [24]:
df.fillna(df.mean())

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  0.0
2  0.0  0.0  0.0

In [25]:
df.mean()

0    1.666667
1    2.333333
2    1.000000
dtype: float64

# Data Transformation

In [26]:
veri = pd.DataFrame({"a":["bir","iki"]*3,"b":[1,1,2,3,2,3]})

In [27]:
veri

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3
4  bir  2
5  iki  3

gördüğümüz gibi 2-3 ve 4-5 indexler tekrar ediyor ve bu durumu tespit etmek için duplicated fonksiyonunu kullanmamız gerekiyor

In [28]:
veri.duplicated()

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [29]:
veri.drop_duplicates()

     a  b
0  bir  1
1  iki  1
2  bir  2
3  iki  3

sütunsal olarak tekrar eden verilere bakacak olursak

In [30]:
veri["c"] = range(6)

In [31]:
veri

     a  b  c
0  bir  1  0
1  iki  1  1
2  bir  2  2
3  iki  3  3
4  bir  2  4
5  iki  3  5

In [32]:
veri.duplicated("a")

0    False
1    False
2     True
3     True
4     True
5     True
dtype: bool

In [33]:
veri.duplicated(["a","b"])

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [34]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  0.0
2  0.0  0.0  0.0

In [35]:
pd.DataFrame(df,index=["bir","iki","uc","dort","bes"])

       0   1   2
bir  NaN NaN NaN
iki  NaN NaN NaN
uc   NaN NaN NaN
dort NaN NaN NaN
bes  NaN NaN NaN

İndex isimlerini değistirebiliryoruz

In [40]:
df.index = df.index.map(pd.Series(["bir","iki","uc","dort","bes"]))

In [41]:
df

       Tom  80  M
bir    Tim  85  M
iki    Kim  70  M
uc    Kate  90  F
dort  Alex  75  F

In [42]:
df.rename(index=str.title,columns=str.upper)

       TOM  80  M
Bir    Tim  85  M
Iki    Kim  70  M
Uc    Kate  90  F
Dort  Alex  75  F

In [43]:
df.rename(index={0:"sifir",1:"bir",2:"iki",3:"uc",4:"dort"},columns=str.upper)

       TOM  80  M
bir    Tim  85  M
iki    Kim  70  M
uc    Kate  90  F
dort  Alex  75  F

In [44]:
df.rename(index={"sifir":0,"bir":1,"iki":2,"uc":3,"dort":4},columns={"ISIM":"isim","PUAN":"puan","CINSIYET":"cinsiyet"},inplace=True)

In [45]:
df.rename(columns=str.title)

    Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

# Veri setlerini birleştirmek(Merging Combining Datasets)

Dataframe tipinde 2 tane veri oluşturacağız .

In [46]:
dt1 = pd.DataFrame({"anahtar":["a","b","c","c","d","e"],"say1":range(6)})
dt2 = pd.DataFrame({"anahtar":["b","c","d","e"],"say2":range(4)})

In [47]:
dt1

  anahtar  say1
0       a     0
1       b     1
2       c     2
3       c     3
4       d     4
5       e     5

In [48]:
dt2

  anahtar  say2
0       b     0
1       c     1
2       d     2
3       e     3

In [49]:
pd.merge(dt1,dt2)

  anahtar  say1  say2
0       b     1     0
1       c     2     1
2       c     3     1
3       d     4     2
4       e     5     3

In [50]:
pd.merge(dt1,dt2,on="anahtar",how="outer")

  anahtar  say1  say2
0       a     0   NaN
1       b     1   0.0
2       c     2   1.0
3       c     3   1.0
4       d     4   2.0
5       e     5   3.0

## Gerçek veri setinde öğrendiklerimizi gösterelim

In [65]:
oyun = pd.read_csv("https://raw.githubusercontent.com/TirendazAcademy/PANDAS-TUTORIAL/main/DataSets/vgsalesGlobale.csv")

In [66]:
oyun.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [67]:
oyun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16598 entries, 0 to 16597
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Rank          16598 non-null  int64
 1   Name          16598 non-null  object
 2   Platform      16598 non-null  object
 3   Year          16327 non-null  float64
 4   Genre         16598 non-null  object
 5   Publisher     16540 non-null  object
 6   NA_Sales      16598 non-null  float64
 7   EU_Sales      16598 non-null  float64
 8   JP_Sales      16598 non-null  float64
 9   Other_Sales   16598 non-null  float64
 10  Global_Sales  16598 non-null  float64
dtypes: float64(6), int64(1), object(4)
memory usage: 1.4+ MB

In [68]:
oyun.describe()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
count,16598.000000,16327.000000,16598.000000,16598.000000,16598.000000,16598.000000,16598.000000
mean,8300.605254,2006.406443,0.264667,0.146652,0.077782,0.048063,0.537441
std,4791.853933,5.828981,0.816683,0.505351,0.309291,0.188588,1.555028
min,1.000000,1980.000000,0.000000,0.000000,0.000000,0.000000,0.010000
25%,4151.250000,2003.000000,0.000000,0.000000,0.000000,0.000000,0.060000
50%,8300.500000,2007.000000,0.080000,0.020000,0.000000,0.010000,0.170000
75%,12449.750000,2010.000000,0.240000,0.110000,0.040000,0.040000,0.470000
max,16600.000000,2020.000000,41.490000,29.020000,10.220000,10.570000,82.740000

In [71]:
oyun.Year.value_counts()

Year
2009.0    1431
2008.0    1428
2010.0    1259
2007.0    1202
2011.0    1139
2006.0    1008
2005.0     941
2002.0     829
2003.0     775
2004.0     763
2012.0     657
2015.0     614
2014.0     582
2013.0     546
2001.0     482
1998.0     379
2000.0     349
2016.0     344
1999.0     338
1997.0     289
1996.0     263
1995.0     219
1994.0     121
1993.0      60
1981.0      46
1992.0      43
1991.0      41
1982.0      36
1986.0      21
1989.0      17
1983.0      17
1990.0      16
1987.0      16
1988.0      15
1985.0      14
1984.0      14
1980.0       9
2017.0       3
2020.0       1
Name: count, dtype: int64

In [72]:
oyun.Year.unique()

array([2006., 1985., 2008., 2009., 1996., 1989., 1984., 2005., 1999.,
       2007., 2010., 2013., 2004., 1990., 1988., 2002., 2001., 2011.,
       1998., 2015., 2012., 2014., 1992., 1997., 1993., 1994., 1982.,
       2003., 1986., 2000.,   nan, 1995., 2016., 1991., 1981., 1987.,
       1980., 1983., 2020., 2017.])

In [80]:
grup = oyun.groupby("Genre")

In [81]:
grup

In [83]:
grup["Global_Sales"].count()

Genre
Action          3316
Adventure       1286
Fighting         848
Misc            1739
Platform         886
Puzzle           582
Racing          1249
Role-Playing    1488
Shooter         1310
Simulation       867
Sports          2346
Strategy         681
Name: Global_Sales, dtype: int64

In [84]:
oyun.Global_Sales.count()

16598

In [86]:
oyun.Global_Sales.value_counts()

Global_Sales
0.02    1071
0.03     811
0.04     645
0.05     632
0.01     618
        ...
5.01       1
5.05       1
5.07       1
5.11       1
3.16       1
Name: count, Length: 623, dtype: int64

In [87]:
oyun.Genre.value_counts()

Genre
Action          3316
Sports          2346
Misc            1739
Role-Playing    1488
Shooter         1310
Adventure       1286
Racing          1249
Platform         886
Simulation       867
Fighting         848
Strategy         681
Puzzle           582
Name: count, dtype: int64

In [88]:
grup["Year"].count()

Genre
Action          3253
Adventure       1276
Fighting         836
Misc            1710
Platform         876
Puzzle           571
Racing          1226
Role-Playing    1471
Shooter         1282
Simulation       851
Sports          2304
Strategy         671
Name: Year, dtype: int64